TexasInstruments/mcupsdk-core/examples/drivers/epwm/epwm_xcmp_dma/am261x-lp/r5fss0-0_nortos/example.syscfg
epwm2.$name                                                  = "CONFIG_EPWM1";
epwm2.epwmTimebase_period                                    = 100;
epwm2.epwmXCMP_enableMode                                    = true;
epwm2.epwmXCMP_SplitCheck                                    = true;
epwm2.epwmXCMP_Split_A                                       = "EPWM_XCMP_4_CMPA";
epwm2.epwmXCMP_Split_B                                       = "EPWM_XCMP_4_CMPB";
epwm2.epwmXCMP1_Active                                       = 10;
epwm2.epwmXCMP2_Active                                       = 20;
epwm2.epwmXCMP3_Active                                       = 30;
epwm2.epwmXCMP4_Active                                       = 40;
epwm2.epwmXCMP5_Active                                       = 50;
epwm2.epwmXCMP6_Active                                       = 60;
epwm2.epwmXCMP7_Active                                       = 70;
epwm2.epwmXCMP8_Active                                       = 80;
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_ACTIVE   = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_ACTIVE   = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_ACTIVE   = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_ACTIVE   = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmXTBPRD_Active                                      = 100;
epwm2.epwmXLOADCTL_Shadowlevel                               = "EPWM_XCMP_XLOADCTL_SHDWLEVEL_3";
epwm2.epwmXTBPRD_Shdw1                                       = 100;
epwm2.epwmXTBPRD_Shdw2                                       = 100;
epwm2.epwmXTBPRD_Shdw3                                       = 100;
epwm2.epwmXCMP1_Shdw1                                        = 10;
epwm2.epwmXCMP2_Shdw1                                        = 20;
epwm2.epwmXCMP3_Shdw1                                        = 30;
epwm2.epwmXCMP4_Shdw1                                        = 40;
epwm2.epwmXCMP5_Shdw1                                        = 50;
epwm2.epwmXCMP6_Shdw1                                        = 60;
epwm2.epwmXCMP7_Shdw1                                        = 70;
epwm2.epwmXCMP8_Shdw1                                        = 80;
epwm2.epwmXCMP1_Shdw2                                        = 10;
epwm2.epwmXCMP2_Shdw2                                        = 20;
epwm2.epwmXCMP3_Shdw2                                        = 30;
epwm2.epwmXCMP4_Shdw2                                        = 40;
epwm2.epwmXCMP5_Shdw2                                        = 50;
epwm2.epwmXCMP6_Shdw2                                        = 60;
epwm2.epwmXCMP7_Shdw2                                        = 70;
epwm2.epwmXCMP8_Shdw2                                        = 80;
epwm2.epwmXCMP1_Shdw3                                        = 10;
epwm2.epwmXCMP2_Shdw3                                        = 20;
epwm2.epwmXCMP3_Shdw3                                        = 30;
epwm2.epwmXCMP4_Shdw3                                        = 40;
epwm2.epwmXCMP5_Shdw3                                        = 50;
epwm2.epwmXCMP6_Shdw3                                        = 60;
epwm2.epwmXCMP7_Shdw3                                        = 70;
epwm2.epwmXCMP8_Shdw3                                        = 80;
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_1 = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_1 = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_1 = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_1 = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_2 = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_2 = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_2 = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_2 = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_3 = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_3 = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_3 = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_3 = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmXLOADCTL_RepeatBuf2                                = 5;
epwm2.epwmXLOADCTL_RepeatBuf3                                = 5;
epwm2.epwmTimebase_emulationMode                             = "EPWM_EMULATION_FREE_RUN";
epwm2.epwmXLOADCTL_Loadmode                                  = "EPWM_XCMP_XLOADCTL_LOADMODE_LOADMULTIPLE";
epwm2.EPWM.$assign                                           = "EPWM6";
epwm2.EPWM.A.$assign                                         = "GPIO55";
epwm2.EPWM.B.$assign                                         = "GPIO56";

epwm3.$name                                                  = "CONFIG_EPWM2";
epwm3.epwmTimebase_period                                    = 100;
epwm3.epwmXCMP_enableMode                                    = true;
epwm3.epwmXCMP_SplitCheck                                    = true;
epwm3.epwmXCMP_Split_A                                       = "EPWM_XCMP_4_CMPA";
epwm3.epwmXCMP_Split_B                                       = "EPWM_XCMP_4_CMPB";
epwm3.epwmXCMP1_Active                                       = 10;
epwm3.epwmXCMP2_Active                                       = 20;
epwm3.epwmXCMP3_Active                                       = 30;
epwm3.epwmXCMP4_Active                                       = 40;
epwm3.epwmXCMP5_Active                                       = 50;
epwm3.epwmXCMP6_Active                                       = 60;
epwm3.epwmXCMP7_Active                                       = 70;
epwm3.epwmXCMP8_Active                                       = 80;
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_ACTIVE   = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_ACTIVE   = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_ACTIVE   = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_ACTIVE   = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmXTBPRD_Active                                      = 100;
epwm3.epwmXLOADCTL_Shadowlevel                               = "EPWM_XCMP_XLOADCTL_SHDWLEVEL_3";
epwm3.epwmXTBPRD_Shdw1                                       = 100;
epwm3.epwmXTBPRD_Shdw2                                       = 100;
epwm3.epwmXTBPRD_Shdw3                                       = 100;
epwm3.epwmXCMP1_Shdw1                                        = 10;
epwm3.epwmXCMP2_Shdw1                                        = 20;
epwm3.epwmXCMP3_Shdw1                                        = 30;
epwm3.epwmXCMP4_Shdw1                                        = 40;
epwm3.epwmXCMP5_Shdw1                                        = 50;
epwm3.epwmXCMP6_Shdw1                                        = 60;
epwm3.epwmXCMP7_Shdw1                                        = 70;
epwm3.epwmXCMP8_Shdw1                                        = 80;
epwm3.epwmXCMP1_Shdw2                                        = 10;
epwm3.epwmXCMP2_Shdw2                                        = 20;
epwm3.epwmXCMP3_Shdw2                                        = 30;
epwm3.epwmXCMP4_Shdw2                                        = 40;
epwm3.epwmXCMP5_Shdw2                                        = 50;
epwm3.epwmXCMP6_Shdw2                                        = 60;
epwm3.epwmXCMP7_Shdw2                                        = 70;
epwm3.epwmXCMP8_Shdw2                                        = 80;
epwm3.epwmXCMP1_Shdw3                                        = 10;
epwm3.epwmXCMP2_Shdw3                                        = 20;
epwm3.epwmXCMP3_Shdw3                                        = 30;
epwm3.epwmXCMP4_Shdw3                                        = 40;
epwm3.epwmXCMP5_Shdw3                                        = 50;
epwm3.epwmXCMP6_Shdw3                                        = 60;
epwm3.epwmXCMP7_Shdw3                                        = 70;
epwm3.epwmXCMP8_Shdw3                                        = 80;
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_1 = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_1 = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_1 = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_1 = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_2 = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_2 = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_2 = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_2 = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_3 = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_3 = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_3 = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_3 = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmXLOADCTL_RepeatBuf3                                = 5;
epwm3.epwmXLOADCTL_RepeatBuf2                                = 5;
epwm3.epwmTimebase_emulationMode                             = "EPWM_EMULATION_FREE_RUN";
epwm3.epwmXLOADCTL_Loadmode                                  = "EPWM_XCMP_XLOADCTL_LOADMODE_LOADMULTIPLE";
epwm3.EPWM.$assign                                           = "EPWM2";
epwm3.EPWM.A.$assign                                         = "GPIO47";
epwm3.EPWM.B.$assign                                         = "GPIO48";

epwm4.$name                                                  = "CONFIG_EPWM3";
epwm4.epwmTimebase_period                                    = 100;
epwm4.epwmXCMP_enableMode                                    = true;
epwm4.epwmXCMP_SplitCheck                                    = true;
epwm4.epwmXCMP_Split_A                                       = "EPWM_XCMP_4_CMPA";
epwm4.epwmXCMP_Split_B                                       = "EPWM_XCMP_4_CMPB";
epwm4.epwmXCMP1_Active                                       = 10;
epwm4.epwmXCMP2_Active                                       = 20;
epwm4.epwmXCMP3_Active                                       = 30;
epwm4.epwmXCMP4_Active                                       = 40;
epwm4.epwmXCMP5_Active                                       = 50;
epwm4.epwmXCMP6_Active                                       = 60;
epwm4.epwmXCMP7_Active                                       = 70;
epwm4.epwmXCMP8_Active                                       = 80;
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_ACTIVE   = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_ACTIVE   = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_ACTIVE   = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_ACTIVE   = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmXTBPRD_Active                                      = 100;
epwm4.epwmXLOADCTL_Shadowlevel                               = "EPWM_XCMP_XLOADCTL_SHDWLEVEL_3";
epwm4.epwmXTBPRD_Shdw1                                       = 100;
epwm4.epwmXTBPRD_Shdw2                                       = 100;
epwm4.epwmXTBPRD_Shdw3                                       = 100;
epwm4.epwmXCMP1_Shdw1                                        = 10;
epwm4.epwmXCMP2_Shdw1                                        = 20;
epwm4.epwmXCMP3_Shdw1                                        = 30;
epwm4.epwmXCMP4_Shdw1                                        = 40;
epwm4.epwmXCMP5_Shdw1                                        = 50;
epwm4.epwmXCMP6_Shdw1                                        = 60;
epwm4.epwmXCMP7_Shdw1                                        = 70;
epwm4.epwmXCMP8_Shdw1                                        = 80;
epwm4.epwmXCMP1_Shdw2                                        = 10;
epwm4.epwmXCMP2_Shdw2                                        = 20;
epwm4.epwmXCMP3_Shdw2                                        = 30;
epwm4.epwmXCMP4_Shdw2                                        = 40;
epwm4.epwmXCMP5_Shdw2                                        = 50;
epwm4.epwmXCMP6_Shdw2                                        = 60;
epwm4.epwmXCMP7_Shdw2                                        = 70;
epwm4.epwmXCMP8_Shdw2                                        = 80;
epwm4.epwmXCMP1_Shdw3                                        = 10;
epwm4.epwmXCMP2_Shdw3                                        = 20;
epwm4.epwmXCMP3_Shdw3                                        = 30;
epwm4.epwmXCMP4_Shdw3                                        = 40;
epwm4.epwmXCMP5_Shdw3                                        = 50;
epwm4.epwmXCMP6_Shdw3                                        = 60;
epwm4.epwmXCMP7_Shdw3                                        = 70;
epwm4.epwmXCMP8_Shdw3                                        = 80;
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_1 = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_1 = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_1 = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_1 = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_2 = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_2 = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_2 = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_2 = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_3 = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_3 = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_3 = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_3 = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmXLOADCTL_RepeatBuf3                                = 5;
epwm4.epwmXLOADCTL_RepeatBuf2                                = 5;
epwm4.epwmTimebase_emulationMode                             = "EPWM_EMULATION_FREE_RUN";
epwm4.epwmXLOADCTL_Loadmode                                  = "EPWM_XCMP_XLOADCTL_LOADMODE_LOADMULTIPLE";
epwm4.EPWM.$assign                                           = "EPWM3";
epwm4.EPWM.A.$assign                                         = "GPIO49";
epwm4.EPWM.B.$assign                                         = "GPIO50";

